Revit 2026 API

# AreaCreationData Properties

---

The AreaCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TagPoint | Specify the location of the area tag. |

#### Reference

AreaCreationData Class

Autodesk.Revit.Creation Namespace